Autodesk.Revit.DB.DimensionLeaderArrowType
An enumerated type containing possible arrow types for dimension leader
Since:
2021.1
Since:
2021.1

Autodesk.Revit.DB.DimensionLeaderArrowType.FilledArrow25Deg
Outdated, converted to Arrow in upgrade function

Autodesk.Revit.DB.DimensionLeaderArrowType.Arrow25Deg
Outdated, converted to Arrow in upgrade function

Autodesk.Revit.DB.DimensionLeaderArrowType.None
Outdated -- things that used it now use a LeaderStyle choice None

Autodesk.Revit.DB.DimensionLeaderArrowType.WideArrow
Outdated, converted to Arrow in upgrade function

Autodesk.Revit.DB.DimensionLeaderArrowType.NarrowArrow
Outdated, converted to Arrow in upgrade function